Documents/А_ВводОстатковОтчетаPL.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ВводОстатковОтчетаPL</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ОстаткиОтчетаPL</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СводНаправления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяPL</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.А_Статьи_PL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ1СНачалаГода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ2СНачалаГода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ1Накопительно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ2Накопительно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/А_ОстаткиОтчетаPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ОстаткиОтчетаPL</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаФ1СНачалаГода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФ2СНачалаГода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФ1Накопительно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФ2Накопительно</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяPL</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_Статьи_PL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СводНаправления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/А_ОтчетPL.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ОтчетPL</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ДенежныеСредстваФинАгенты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьДочерние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеОтчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_Статьи_PL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФома1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФорма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСтроки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.А_ТипСтатьиPL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтогиПоГруппам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ГруппаСтатей_PL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ1_Excel</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ2_Excel</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Excel</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_Расчёт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расхождение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИтогиОбщие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПоказателя</Name>
							<Type>
								<v8:Type>cfg:EnumRef.А_ВидПоказателяPL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФ2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаИтого</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/А_ВводОстатковОтчетаPL/Ext/ObjectModule.bsl
// Документ «Ввод остатков отчета PL» — переходная база накопительных показателей
// отчёта А_ОтчетPL_ПолныйЕРП_Остатки (решение финансиста 28.08.2026).
//
// Фиксирует на дату документа по каждому подразделению и статье PL два показателя
// в разрезе Ф1/Ф2 и двух слоёв (объектный / свод направления, как ВключатьДочерние
// у А_ОтчетPL):
//   «PL с начала года»  — обороты с 1 января года даты документа по дату документа;
//   «Накопительный PL»  — вся деятельность по дату документа.
// Остатки вводятся ПО-ЛИСТОВО (решение финансиста 31.08.2026): на каждый лист книги
// выгрузки (РегистрСведений.А_СтруктураВыгрузкиОтчетаPLвЕксел) — свой документ,
// Комментарий = имя листа. Каждая комбинация Подразделение × Статья PL × Слой
// фиксируется РОВНО ОДНИМ документом (контроль пересечений в ПередЗаписью) —
// иначе отчёт-потребитель задвоил бы суммы.

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		// Каждая комбинация Подразделение × Статья PL × Слой — ровно в одном документе.
		ТаблицаКлючей = Остатки.Выгрузить(, "Подразделение, СтатьяPL, СводНаправления");
		ТаблицаКлючей.Свернуть("Подразделение, СтатьяPL, СводНаправления");
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Ключи.Подразделение КАК Подразделение,
		|	Ключи.СтатьяPL КАК СтатьяPL,
		|	Ключи.СводНаправления КАК СводНаправления
		|ПОМЕСТИТЬ втМоиКлючи
		|ИЗ
		|	&ТаблицаКлючей КАК Ключи
		|;
		|ВЫБРАТЬ ПЕРВЫЕ 20
		|	Ост.Регистратор КАК Регистратор,
		|	Ост.Подразделение КАК Подразделение,
		|	Ост.СтатьяPL КАК СтатьяPL,
		|	Ост.СводНаправления КАК СводНаправления
		|ИЗ
		|	РегистрНакопления.А_ОстаткиОтчетаPL КАК Ост
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМоиКлючи КАК Ключи
		|		ПО Ост.Подразделение = Ключи.Подразделение
		|			И Ост.СтатьяPL = Ключи.СтатьяPL
		|			И Ост.СводНаправления = Ключи.СводНаправления
		|ГДЕ
		|	Ост.Регистратор <> &ТекущаяСсылка";
		Запрос.УстановитьПараметр("ТаблицаКлючей", ТаблицаКлючей);
		Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();
		Если Результат.Количество() > 0 Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон("Пересечение с другим документом остатков: «%1» — подразделение «%2», статья «%3»%4.
					|Каждая комбинация подразделение × статья × слой вводится ровно одним документом;
					|уберите строку здесь или в том документе.",
					Результат[0].Регистратор, Результат[0].Подразделение, Результат[0].СтатьяPL,
					?(Результат.Количество() > 1,
						" (показано первое из " + Формат(Результат.Количество(), "ЧГ=0") + " пересечений, включая соседние)", "")),
				Ссылка);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Движения.А_ОстаткиОтчетаPL.Записывать = Истина;
	Движения.А_ОстаткиОтчетаPL.Очистить();

	Для Каждого СтрокаТЧ Из Остатки Цикл
		Движение = Движения.А_ОстаткиОтчетаPL.Добавить();
		Движение.Период = Дата;
		Движение.Подразделение = СтрокаТЧ.Подразделение;
		Движение.СтатьяPL = СтрокаТЧ.СтатьяPL;
		Движение.СводНаправления = СтрокаТЧ.СводНаправления;
		Движение.СуммаФ1СНачалаГода = СтрокаТЧ.СуммаФ1СНачалаГода;
		Движение.СуммаФ2СНачалаГода = СтрокаТЧ.СуммаФ2СНачалаГода;
		Движение.СуммаФ1Накопительно = СтрокаТЧ.СуммаФ1Накопительно;
		Движение.СуммаФ2Накопительно = СтрокаТЧ.СуммаФ2Накопительно;
	КонецЦикла;

КонецПроцедуры

// Заполняет ТЧ «Остатки» из проведённых документов А_ОтчетPL по дату документа.
// Оба слоя (объектные и свод-документы направлений — по ВключатьДочерние).
// Проверено 31.08.2026: свод-слой «Операционный доход» за янв–июнь-2026 совпадает
// с книгой «!PL по компании Червень 2026» копейка-в-копейку по всем направлениям
// (Строительство 339 313 061,76; Производство 51 004 810,23; Логистика 2 788 550,00;
// Спецтехника 12 404 410,34) — свод-документы содержат и закрытые объекты.
Процедура ЗаполнитьИзДокументовPL() Экспорт

	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		ВызватьИсключение "Заполните дату документа — это дата остатков.";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Подразделение КАК Подразделение,
	|	Док.ВключатьДочерние КАК СводНаправления,
	|	Стр.Статья КАК СтатьяPL,
	|	СУММА(ВЫБОР КОГДА Док.Дата >= &НачалоГода ТОГДА Стр.СуммаФома1 ИНАЧЕ 0 КОНЕЦ) КАК СуммаФ1СНачалаГода,
	|	СУММА(ВЫБОР КОГДА Док.Дата >= &НачалоГода ТОГДА Стр.СуммаФорма2 ИНАЧЕ 0 КОНЕЦ) КАК СуммаФ2СНачалаГода,
	|	СУММА(Стр.СуммаФома1) КАК СуммаФ1Накопительно,
	|	СУММА(Стр.СуммаФорма2) КАК СуммаФ2Накопительно
	|ИЗ
	|	Документ.А_ОтчетPL.ДанныеОтчета КАК Стр
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.А_ОтчетPL КАК Док
	|		ПО Стр.Ссылка = Док.Ссылка
	|ГДЕ
	|	Док.Проведен
	|	И Док.Дата <= &ДатаОстатков
	|	И Стр.Статья <> ЗНАЧЕНИЕ(Справочник.А_Статьи_PL.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	Док.Подразделение, Док.ВключатьДочерние, Стр.Статья";
	Запрос.УстановитьПараметр("НачалоГода", НачалоГода(Дата));
	Запрос.УстановитьПараметр("ДатаОстатков", Дата);

	Выборка = Запрос.Выполнить().Выбрать();
	Остатки.Очистить();
	Пока Выборка.Следующий() Цикл
		// Полностью нулевые комбинации не тащим — строки без сумм бесполезны финансисту.
		Если Выборка.СуммаФ1Накопительно = 0 И Выборка.СуммаФ2Накопительно = 0
			И Выборка.СуммаФ1СНачалаГода = 0 И Выборка.СуммаФ2СНачалаГода = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТЧ = Остатки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;

КонецПроцедуры
